# import libraries

In [57]:
from libraress import librariesMod as ab
import pandas as pd

# import datasets

In [58]:
table_1 = 'data_sets/only_wood_customer_us_1.csv'
table_2 = 'data_sets/only_wood_customer_us_2.csv'
table_3 = 'data_sets/only_wood_customer_us_3.csv'

# Read_DATA

In [59]:
columns_for_t2 = ['Age', 'City', 'Gender', 'Name', 'Email']
df1 = pd.read_csv(table_1)
df2 = pd.read_csv(table_2, sep=';', header=None)
df2.columns = columns_for_t2
df3 = pd.read_csv(table_3, sep="\t|,", engine='python')

# step 1 Clean table 1

In [60]:
df1.Gender = df1.Gender.apply(lambda x: 'Male' if (x == '0') or x.lower() == 'male' or x.lower() == 'm' else 'Female')  #"""gender clean"""
df1.FirstName = df1.FirstName.apply(ab.f_name)  # Last_Name Clean
df1.LastName = df1.LastName.apply(ab.f_name)  # First_Name Clean
df1.Email = df1['Email'].apply(lambda x: x.lower())  # Email CLean
df1.City = df1.City.apply(lambda x: x.replace('-', ' ').replace('_', ' ').title())  # City Clean
df1.Country = df1.Country.apply(lambda x: 'USA')   # Clean Country
df1.drop(['UserName'],inplace=True, axis=1) # delete column 'UserName'

In [61]:
df1.head(10)

,Gender,FirstName,LastName,Email,Age,City,Country
0,Female,Latesha,Barton,forgottoask@woodinc,85,Indianapolis,USA
1,Female,Yolando,Jast,yolando_jast@yahoo.com,53,Columbus,USA
2,Male,Stacy,Johnson,stacy.johnson@yahoo.com,64,Indianapolis,USA
3,Male,Abdul,Mayert,mayert.abdul@hotmail.com,79,Phoenix,USA
4,Male,Julius,Reinger,reinger_julius@hotmail.com,65,Jacksonville,USA
5,Female,Liliana,Dubuque,liliana_dubuque@yahoo.com,24,Columbus,USA
6,Male,Ollie,Cruickshank,cruickshank.ollie@gmail.com,89,Houston,USA
7,Male,Louis,Schiller,louis_schiller@hotmail.com,72,Seattle,USA
8,Female,Verlene,Jones,jones.verlene@hotmail.com,64,Seattle,USA
9,Male,Santiago,Carter,santiago_carter@yahoo.com,34,Chicago,USA

# step 2 Clean table 2

In [62]:
df1.Gender = df1.Gender.apply(lambda x: 'Male' if (x == '0') or x.lower() == 'male' or x.lower() == 'm' else 'Female')  #"""gender clean"""
df1.FirstName = df1.FirstName.apply(ab.f_name)  # Last_Name Clean
df1.LastName = df1.LastName.apply(ab.f_name)  # First_Name Clean
df1.Email = df1['Email'].apply(lambda x: x.lower())  # Email CLean
df1.City = df1.City.apply(lambda x: x.replace('-', ' ').replace('_', ' ').title())  # City Clean
df1.Country = df1.Country.apply(lambda x: 'USA')   # Clean Country
# df1.drop(['UserName'],inplace=True, axis=1) # delete column 'UserName'

In [63]:
df2.City = df2.City.apply(lambda x: 'Male' if (x == '0') or x.lower() == 'male' or x.lower() == 'm' else 'Female')  #"""gender clean"""
df2['FirstName'] = df2.Name.apply(ab.re_f_name)
df2['LastName'] = df2.Name.apply(ab.re_last_name)
df2.drop(['Name'],inplace=True, axis=1) # Delete column 'Name'
df2.Email = df2['Email'].apply(lambda x: x.lower() if isinstance(x, str) else x)    # Email CLean
df2['Country'] = 'USA'   # create column 'Country'

In [64]:
df2.head(10)

,Age,City,Gender,Email,FirstName,LastName,Country
0,51,Female,1,kutch.lorette@gmail.com,Lorette,Kutch,USA
1,84,Female,Female,clorinda.wiza@gmail.com,Clorinda,Wiza,USA
2,97,Female,Male,littel.joesph@gmail.com,Joesph,Littel,USA
3,90,Female,Male,carlo_stokes@gmail.com,Carlo,Stokes,USA
4,57,Female,Male,kasey.prosacco@hotmail.com,Kasey,Prosacco,USA
5,65,Female,Male,hahn.will@gmail.com,Will,Hahn,USA
6,57,Female,Female,junko_stokes@yahoo.com,Junko,Stokes,USA
7,58,Female,Female,paucek.kacey@gmail.com,Kacey,Paucek,USA
8,83,Female,Male,zieme_renato@gmail.com,Renato,Zieme,USA
9,51years,Female,Male,william_becker@hotmail.com,William,Becker,USA

# step 3 Clean table 3

In [65]:
df3['Gender'] = df3.Gender.apply(ab.re_gender)
df3['FirstName'] = df3.Name.apply(ab.res_f_name)
df3['LastName'] = df3.Name.apply(ab.res_l_name)
df3.drop('Name', inplace=True, axis=1)
df3.Country = 'USA'
df3.Age = df3.Age.apply(lambda x: int(x[9:11]))
df3.Email = df3['Email'].apply(lambda x: x[7:].lower() if isinstance(x, str) else x) # Email CLean

In [66]:
df3.head(10)

,Gender,Email,Age,City,Country,FirstName,LastName
0,Male,dach.kendall@hotmail.com,26,string_Dallas,USA,Kendall,Dach
1,Male,jonathon.schneider@gmail.com,91,string_INDIANAPOLIS,USA,Jonathon,Schneider
2,Male,konopelski_jarod@hotmail.com,38,string_Chicago,USA,Jarod,Konopelski
3,Male,upton_glen@gmail.com,30,string_Austin,USA,Glen,Upton
4,Male,ratke.tracey@hotmail.com,51,string_Austin,USA,Tracey,Ratke
5,Female,robbin_bergnaum@yahoo.com,60,string_Fort-Worth,USA,Robbin,Bergnaum
6,Female,larkin.maye@hotmail.com,34,string_SAN_JOSE,USA,Maye,Larkin
7,Female,earl.rohan@hotmail.com,19,string_Philadelphia,USA,Earl,Rohan
8,Male,donnelly_jeromy@yahoo.com,33,string_Phoenix,USA,Jeromy,Donnelly
9,Female,lannie.cole@yahoo.com,70,string_Philadelphia,USA,Lannie,Cole

# step 4 Add data

In [68]:
all_df = pd.concat([df1, df2, df3])

In [69]:
print(all_df.shape)

(30000, 7)

In [70]:
all_df.head(10)

,Gender,FirstName,LastName,Email,Age,City,Country
0,Female,Latesha,Barton,forgottoask@woodinc,85,Indianapolis,USA
1,Female,Yolando,Jast,yolando_jast@yahoo.com,53,Columbus,USA
2,Male,Stacy,Johnson,stacy.johnson@yahoo.com,64,Indianapolis,USA
3,Male,Abdul,Mayert,mayert.abdul@hotmail.com,79,Phoenix,USA
4,Male,Julius,Reinger,reinger_julius@hotmail.com,65,Jacksonville,USA
5,Female,Liliana,Dubuque,liliana_dubuque@yahoo.com,24,Columbus,USA
6,Male,Ollie,Cruickshank,cruickshank.ollie@gmail.com,89,Houston,USA
7,Male,Louis,Schiller,louis_schiller@hotmail.com,72,Seattle,USA
8,Female,Verlene,Jones,jones.verlene@hotmail.com,64,Seattle,USA
9,Male,Santiago,Carter,santiago_carter@yahoo.com,34,Chicago,USA

In [71]:
# step 5 CSV TO SQL

In [72]:
ab.csv_to_sql(all_df)

30000